USE activist_diary;

SET FOREIGN_KEY_CHECKS = 0;

INSERT INTO departments (
    id, parent_id, name, description, leader_id,
    default_attachment_req, created_at, updated_at, deleted_at
) VALUES
('032eaf39-4666-11f1-97b3-00155de07309', NULL, 'Продакшн', 'Ведение социальных сетей, визуальная составляющая мероприятий', NULL, '["photo", "video", "text", "file"]', '2026-05-02 23:32:17', '2026-05-07 23:58:31', NULL),
('15f36aab-4668-11f1-97b3-00155de07309', '032eaf39-4666-11f1-97b3-00155de07309', 'Дизайн', 'Визуальное оформление постов, сторис, элементов для мероприятий', NULL, '["photo", "file"]', '2026-05-02 23:47:08', '2026-05-03 01:43:54', NULL),
('583fbf3e-4668-11f1-97b3-00155de07309', '032eaf39-4666-11f1-97b3-00155de07309', 'Копирайт', 'Написание текстов к постам и сторис в социальных сетях', NULL, '["text"]', '2026-05-02 23:48:59', '2026-05-03 00:11:57', NULL),
('8624363c-4668-11f1-97b3-00155de07309', '032eaf39-4666-11f1-97b3-00155de07309', 'Видео', 'Съемка, монтаж видеоконтента', NULL, '["video", "file"]', '2026-05-02 23:50:16', '2026-05-03 00:26:55', NULL),
('9ee614e8-4668-11f1-97b3-00155de07309', '032eaf39-4666-11f1-97b3-00155de07309', 'Тикток', 'Ответственность за ведение TikTok-аккаунта', NULL, '["video", "file"]', '2026-05-02 23:50:58', '2026-05-03 00:24:56', NULL),
('a66e68db-4a45-11f1-97b3-00155de07309', NULL, 'Фандрайзинг', 'Призы на мероприятие', NULL, '["photo", "text"]', '2026-05-07 21:50:43', '2026-05-07 21:50:43', NULL),
('d51a955a-4a57-11f1-97b3-00155de07309', 'a66e68db-4a45-11f1-97b3-00155de07309', 'Партнёрка', 'Призы на мероприятия', NULL, '["photo", "text"]', '2026-05-08 00:00:52', '2026-05-08 00:00:52', NULL),
('e4134c9c-4a57-11f1-97b3-00155de07309', 'a66e68db-4a45-11f1-97b3-00155de07309', 'Промоушен', 'Билеты на мероприятия, производство мерча', NULL, '["photo", "text"]', '2026-05-08 00:01:17', '2026-05-08 00:01:17', NULL);

SET FOREIGN_KEY_CHECKS = 1;